# Matthew Sampsons Doom config

This is my new literate config :) Follow me on twitter lol

#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Matthew Sampson"
      user-mail-address "matthew@graywolfai.com")
;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-vibrant)

;;(setq doom-font (font-spec :family "Attribute Mono" :size 22))
;;(unless (find-font doom-font)
;;  (setq doom-font (font-spec :family "Cascadia Code PL" :size 20)))
;;(setq doom-unicode-font (font-spec :family "Symbola" :size 20))
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/Dropbox/org/")
(setq org-index-file (concat org-directory "getting-things-done.org" ))
(global-set-key (kbd "C-c o")
                (lambda () (interactive) (find-file org-index-file)))
(global-set-key (kbd "C-x c") #'copy-region-as-kill)
(global-set-key (kbd "C-x v") #'org-yank)
* Note taking workflow
Following https://rgoswami.me/posts/org-note-workflow/

#+begin_src elisp
;;(setq org_notes "~/Dropbox/org/notes/")
;;(setq zot_bib)
;;(setq bibtex-completion-bibliography "~/Dropbox/org/zotLib.bib")
;;(after! citar
;;(setq org-cite-global-bibliography
;;        '("~/Dropbox/org/zotLib.bib" "~/Dropbox/org/gw-zotLib.bib"))
;;(setq org-cite-insert-processor 'citar)
;;(setq org-cite-follow-processor 'citar)
;;(setq org-cite-activate-processor 'citar)
;;(setq citar-bibliography org-cite-global-bibliography)
;;(setq citar-notes-paths `("~/Dropbox/Org/roam"))
;;)
;;(use-package! citar
;;  :defer t)
;; commenting out because this seemed to cause an issue when I opened org-capture and it froze emacs (I saw a note about LaaTex-mode hook in the error)
;;(citar-filenotify-setup '(LaTeX-mode-hook org-mode-hook)) ;; following https://github.com/bdarcus/citar#refreshing-the-library-display

;;(setq citar-bibliography '("~/Dropbox/org/zotLib.bib" "~/Dropbox/org/gw-zotLib.bib"))
#+end_src

#+RESULTS:
 ~/Dropbox/org/zotLib.bib  ~/Dropbox/org/gw-zotLib.bib 

